In [23]:
import pandas as pd 
import sqlite3

In [24]:
create_table = """ 
CREATE TABLE student_score(Id INTEGER, Name VARCHAR(20),Math REAL, Science REAL);"""

In [25]:
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

In [26]:
SQL_query = executeSQL.execute('select * from student_score')

In [27]:
resultset = SQL_query.fetchall()

In [28]:
resultset

[]

In [29]:
insertSQL = [(10,'JAck',85,92),
            (29,'Tom',73,89),
            (65,'Ram',65.5,77),
            (5,'Steve',55,91)]

In [30]:
insert_statement = "Insert into student_score values(?,?,?,?)"
executeSQL.executemany(insert_statement,insertSQL)
executeSQL.commit()

In [31]:
select_query = executeSQL.execute("select * from student_score")

In [32]:
resultset = select_query.fetchall()
resultset

[(10, 'JAck', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.5, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [37]:
df_student_recors = pd.DataFrame(resultset,columns=['Id','Name','MAths','Science'])

In [38]:
df_student_recors

   Id   Name  MAths  Science
0  10   JAck   85.0     92.0
1  29    Tom   73.0     89.0
2  65    Ram   65.5     77.0
3   5  Steve   55.0     91.0